/*
 Если переменная a равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
*/

// let a = Number(prompt('Введите число'));
// if (a === 0){
//     alert('Верно')
// } else{
//     alert('Неверно')
// }

/*
 Если переменная a больше нуля, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
 */
//  let a = Number(prompt('Введите число'));
//  if (a > 0){
//      alert('Верно')
//  } else{
//      alert('Неверно')
//  }

/*
Если переменная a меньше нуля, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
*/

// let a = Number(prompt('Введите число'));
// if (a < 0){
//     alert('Верно')
// } else{
//     alert('Неверно')
// }

/*
 Если переменная a больше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
 */
// let a = Number(prompt('Введите число'));
// if (a >= 0){
//     alert('Верно')
// } else{
//     alert('Неверно')
// }

/*
  Если переменная a меньше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
 */
// let a = Number(prompt('Введите число'));
// if (a <= 0){
//     alert('Верно')
// } else{
//     alert('Неверно')
// }
/*
  Если переменная a не равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 1, 0, -3.
 */
//   let a = Number(prompt('Введите число'));
//   if (a !== 0){
//       alert('Верно')
//   } else{
//       alert('Неверно')
//   }
  /*
   Если переменная a равна 'test', то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном 'test', 'тест', 3.
  */
//    let a = prompt('Введите число');
//   if (a === 'test'){
//       alert('Верно')
//   } else{
//       alert('Неверно')
//   }
/*
  Если переменная a равна '1' и по значению и по типу, то выведите 'Верно', иначе выведите 'Неверно'. Проверьте работу скрипта при a, равном '1', 1, 3.
 */
//   let a = prompt('Введите число');
//   if (a === '1'){
//       alert('Верно')
//   } else{
//       alert('Неверно')
//   }


